tutorials.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Tutorials I had written</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-02-20 16:42:12 IST"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content="Mayer Goldberg, tutorials, lambda calculus, Scheme, ML, continuations, threaded code"/>
</head>
<body>
<div id="content">

<h1 class="title">Tutorials I had written</h1>

<p>All the tutorials are <i>work-in-progress</i>. None are complete. I add to each of these as ideas come to me. The early tutorials are written in \(\LaTeX\), and made available in PDF. Later, I learned how to use HTML more productively to create the tutorials, so some of the later ones are in HTML. If you notice any errors or omissions, <a href="mailto:gmayer@little-lisper.org">please email me</a>. 
</p>
<ul>
<li>
<a href="./files/lambda-calculus-tutorial.pdf">My tutorial on the lambda-calculus</a>
</li>
<li>
<a href="./files/jukim-tutorial.pdf">My tutorial on the <i>juk</i> language</a>
</li>
<li>
<a href="./files/compiler-construction-tutorial.pdf">My tutorial on <i>compiler construction</i></a>
</li>
<li>
<a href="./debugging.html">My tutorial on debugging</a>
</li>
<li>
My tutorial on the Scheme programming language (<i>forthcoming</i>)
</li>
<li>
My tutorial on the ML programming language (<i>forthcoming</i>)
</li>
<li>
My tutorial on threaded code (<i>forthcoming</i>)
</li>
<li>
My tutorial on CPS (<i>forthcoming</i>)
</li>
<li>
My tutorial on fixed points (<i>forthcoming</i>)
</li>
</ul>

<div id="postamble">
<p class="author"> Author: Mayer Goldberg
</p>
<p class="date"> Date: 2011-02-20 16:42:12 IST</p>
</div>
</div>
</body>
</html>
